---
kind: property
id: P:Autodesk.Revit.DB.ExtensibleStorage.ExtensibleStorageFilter.SchemaGuid
source: html/ab51420e-88e1-881c-33ae-20e709751891.htm
---
# Autodesk.Revit.DB.ExtensibleStorage.ExtensibleStorageFilter.SchemaGuid Property

Schema id used to filter elements with extensible storage data

## Syntax (C#)
```csharp
public Guid SchemaGuid { get; }
```